export const ErrorCode: Array<string> = [
  '1000', // 系统内部异常!
  '11001', // 参数异常!
  '11002', // 主键非法!
  '11003', // 奖品数据结构异常!请校验数据结构
  '11010', // 奖品概览信息构建异常!
  '11011', // 奖品数据操作人缺失!
  '11013', // 品牌非法!请校验品牌code是否合法!
  '11017', // 指定文件未找到!
  '11018', // 读取指定文件异常!
  '11019', // 解析文件异常!
  '11022', // 导出文件', // 构造数据异常!
  '9000', // 系统异常
  '2004', // 无法获取码信息
  '2007', // ticket换code失败
  '2030', // 瓶盖码缺失
  '1000', // 会员服务异常
  '1002', // 微信授权异常
  '1003', // 微信信息解析异常
  '1004', // 微信信息解析为空
  '1007', // OPENID为空
  '3003', // 调第三方公众号接口失败
  '3005', // 调用腾讯地图API失败
  '3006', // 调用完成邀请任务接口失败
  '7001', // 调用微信接口失败
  '7002', // 模板未找到
  '7003', // 获取用户微信信息失败
  '2031', // 获取联蔚token异常
  '2032', // 获取联蔚码信息异常
  '10001', // 生成的小程序scheme码异常
  '-40002' // -xml解析失败
];
